In [1]:
import numpy as np
import pandas as pd

In [14]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['infantry', 'infantry', 'cavalry', 'cavalry', 'infantry', 'infantry', 'cavalry', 'cavalry','infantry', 'infantry', 'cavalry', 'cavalry'], 
        'experience': ['veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie','veteran', 'rookie', 'veteran', 'rookie'],
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['regiment', 'company', 'experience', 'name', 'preTestScore', 'postTestScore'])
df

      regiment   company experience      name  preTestScore  postTestScore
0   Nighthawks  infantry    veteran    Miller             4             25
1   Nighthawks  infantry     rookie  Jacobson            24             94
2   Nighthawks   cavalry    veteran       Ali            31             57
3   Nighthawks   cavalry     rookie    Milner             2             62
4     Dragoons  infantry    veteran     Cooze             3             70
5     Dragoons  infantry     rookie     Jacon             4             25
6     Dragoons   cavalry    veteran    Ryaner            24             94
7     Dragoons   cavalry     rookie      Sone            31             57
8       Scouts  infantry    veteran     Sloan             2             62
9       Scouts  infantry     rookie     Piger             3             70
10      Scouts   cavalry    veteran     Riani             2             62
11      Scouts   cavalry     rookie       Ali             3             70

In [15]:
pd.crosstab(df.regiment, df.company)

company     cavalry  infantry
regiment
Dragoons          2         2
Nighthawks        2         2
Scouts            2         2

In [7]:
def laplace_mech(v, sensitivity, epsilon):
    return v + np.random.laplace(loc=0, scale=sensitivity/epsilon)

In [17]:
epsilon = 1
pd.crosstab(df.regiment, df.company).applymap(lambda x: laplace_mech(x, 1, epsilon))

# privacy cost is epsilon = 1

company      cavalry  infantry
regiment
Dragoons    3.130392  4.096460
Nighthawks  2.279558  2.762355
Scouts      2.039823 -2.553095

In [18]:
pd.crosstab(df.regiment, df.company, margins=True)

company     cavalry  infantry  All
regiment
Dragoons          2         2    4
Nighthawks        2         2    4
Scouts            2         2    4
All               6         6   12

In [25]:
v= pd.crosstab(df.regiment, df.company).applymap(lambda x: laplace_mech(x, 1, epsilon))
print(v)
print(v.apply(np.sum))
print(v.apply(np.sum, axis=1))
# privacy cost = 1

company      cavalry  infantry
regiment
Dragoons    2.059890  1.906744
Nighthawks -0.369508  2.687251
Scouts      1.530454  4.436563
company
cavalry     3.220837
infantry    9.030558
dtype: float64
regiment
Dragoons      3.966634
Nighthawks    2.317743
Scouts        5.967017
dtype: float64

In [34]:
epsilon1 = 1
epsilon2 = 1
epsilon3 = 1

v_np = pd.crosstab(df.regiment, df.company)
print(pd.crosstab(df.regiment, df.company).applymap(lambda x: laplace_mech(x, 1, epsilon1)))
print(v_np.apply(np.sum).apply(lambda x: laplace_mech(x, 1, epsilon2)))
print(v_np.apply(np.sum, axis=1).apply(lambda x: laplace_mech(x, 1, epsilon3)))

# privacy cost is 3*epsilon
# 1st query: privacy cost of epsilon by parallel composition
# 2nd query: privacy cost of epsilon by parallel composition
# 3rd query: privacy cost of epsilon by parallel composition
# total: 3*epsilon by sequential composition

company      cavalry  infantry
regiment
Dragoons    2.066950  0.830026
Nighthawks -0.289521  1.973490
Scouts      2.522088  4.631538
company
cavalry     6.941393
infantry    7.755355
dtype: float64
regiment
Dragoons      2.476512
Nighthawks    6.446340
Scouts        2.602715
dtype: float64

In [36]:
np.mean(df.postTestScore)

62.333333333333336

In [45]:
laplace_mech(np.sum(df.postTestScore), 100, epsilon)/len(df.postTestScore)

# sensitivity is 100
# because data model says: test scores are between 0 and 100
# privacy cost is epsilon

45.40324428443164